Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: འབར་བས་ནི་ནམ་མཁའ་ལ་འགྲོ་བ་དང་བསྐལ་པ་ཆེན་པོར་འཚོ་བར་འགྱུར་རོ། །
en: If it bursts into flames, one will be able to walk on air and will live for one great eon. {29.12}

source: བ་སེར་སྐྱའི་བེའུ་དང་བཅས་པའི་མར་ཁུ་བླངས་ལ། ཟངས་མའི་སྣོད་དུ་ཤིང་ཨ་ཤྭཏྠའི་ལོ་མ་བདུན་གྱིས་བཀབ་སྟེ་བཞག་ལ། ཇི་སྲིད་གྲུབ་པ་རྣམ་གསུམ་ཐོབ་པ་དེ་སྲིད་ཀྱི་བར་དུ་བཟླས་པ་བྱས་ལ་དེ་འཐུངས་ན་ཐོས་པ་འཛིན་པ་དང་མི་སྣང་བར་འགྱུར་བ་དང་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར་རོ། །
en: “One should obtain some ghee from a tawny cow that has given birth to a calf of the same color, place it in a copper bowl stuffed with seven pipal leaves, and recite the mantra until the triple effect occurs [of the ghee becoming hot, emitting smoke, and bursting into flames]. After drinking it, one will be able to, [respectively], retain in one’s memory everything that one has heard, become invisible, and walk on air. {29.13}

source: སྨན་པུ་སྐར་མཱུ་ལའི་ས་བོན་ཟླ་བ་གཟས་ཟིན་པ་ལ་ཁར་བཅུག་ན་ཇི་སྲིད་དུ་ཙུ་ལུ་ཙུ་ལུ་ཞེས་བྱ་བའི་སྒྲ་འབྱུང་བ་དེ་སྲིད་དུ་བཟླས་པ་བྱས་ལ།
en: “During a lunar eclipse, one should place some puṣkara seeds in one’s mouth and recite the mantra until the seeds make a bubbling sound.

source: སྨན་དེ་ཕྱུང་ནས་ལྕགས་གསུམ་གྱིས་ཡོངས་སུ་དཀྲི་བ་བྱས་ལ་ཡང་ཁར་རབ་ཏུ་བཅུག་ན་མི་སྣང་བར་འགྱུར་རོ། །
en: If one places them in the mouth wrapped in the three metals, one will become invisible.

source: སྨན་དེ་སྐྱུགས་ན་ནི་སྣང་བར་འགྱུར་རོ། །
en: One will become visible again after spitting them out. {29.14}

source: ལི་ཤི་དྲི་ཞིམ་པོ་ཁར་བཅུག་ལ་བཟླས་པ་འབུམ་བྱས་ན་གང་དང་སྨྲ་བ་དེ་དབང་དུ་འགྱུར་རོ། །
en: “One should place in one’s mouth some fragrant cloves and recite the mantra six hundred thousand times. Whoever one speaks to will become enthralled.

source: འོ་མ་དང་ནས་ཆན་ཁྱོར་གང་ཟ་ཞིང་བཟླས་པ་འབུམ་ཕྲག་བཅུ་གཉིས་བྱས་ན་རིག་པ་འཛིན་པར་འགྱུར་རོ། །
en: If one recites the mantra one million two hundred thousand times while subsisting on dishes of milk and barley, one will become a vidyādhara.

source: སློང་མོའི་ཟས་ཀྱིས་འཚོ་ལ་ཤིང་བཞིན་དུ་མི་སྨྲ་བའི་དཀའ་ཐུབ་བྱེད་ཅིང་བཟླས་པ་འབུམ་བྱེད་ན་མི་སྣང་བར་འགྱུར་རོ། །
en: If one recites the mantra one hundred thousand times while living on alms and observing a strict vow of silence, one will become invisible.

source: བཟླས་པ་བྱ་བ་བྱས་ན་ཇི་ལྟར་སྲིད་པ་ཐ་མ་པའི་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་འཇམ་དཔལ་ཆོས་སྟོན་པ་དེ་བཞིན་དུ་འགྱུར་རོ། །
en: If one recites the mantra ten million times, one will receive Dharma teachings from Noble Mañjuśrī [himself] so that one becomes a bodhisattva who sojourns on earth for the last time.

source: རྟག་ཏུ་བཟླས་པ་བྱས་ན་དོན་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ། །
en: If one recites continually, all one’s aims will be accomplished. {29.15}

source: གང་གི་གཟུགས་བརྙན་དྲི་ཐམས་ཅད་པས་བྱས་ལ་བཅད་ཅིང་སྦྱིན་སྲེག་བྱས་ན་ཞག་བདུན་གྱིས་དབང་དུ་འགྱུར་རོ། །
en: “The target whose effigy, made of ‘all fragrances,’ one chops up and offers the fragments of as oblations will become enthralled after seven nights.

source: གུ་གུལ་གྱི་རིལ་བུ་རྒྱ་ཤུག་གི་ཚིག་གུའི་ཚད་ཙམ་ལ་མར་གྱིས་བཏགས་པས་བརྒྱ་ཕྲག་སྟོང་གི་སྦྱིན་སྲེག་བྱས་ན་རྒྱལ་པོ་དབང་དུ་འགྱུར་རོ། །
en: If one offers into the fire one thousand and eight oblations of white mustard seeds smeared with saffron [paste], one will enthrall a king.

source: ཏིལ་ལ་ཞོ་དང་མར་གྱིས་བཏགས་པས་སྦྱིན་སྲེག་འབུམ་ཕྲག་སྟོང་བྱས་ན་ཐམས་ཅད་ཀྱི་དམ་པའི་ཁྱིམ་གྱི་བདག་པོ་ཆེན་པོར་འགྱུར་རོ། །
en: If one offers one hundred thousand oblations of sesame seeds smeared with curds, honey, and ghee, one will become a great householder who gives everything away. {29.17}

source: བའི་ལྕི་བ་ས་ལ་མ་ལྷུང་བས་དཀྱིལ་འཁོར་བྱས་ལ། དེ་ལ་མེ་ཏོག་གིས་གཅལ་དུ་བཀྲམ་སྟེ།
en: “One should draw a circle with uncontaminated cow dung, bestrew it with flowers,

source: བཟླས་པ་བརྒྱ་རྩ་བརྒྱད་བྱས་ལ་དེ་ནས་དམ་པའི་ཆོས་ཀྱི་གླེགས་བམ་བཀླག་པར་བྱས་ན། ཟླ་བ་གཅིག་གིས་མཆོག་ཏུ་ཡིད་གཞུངས་པར་འགྱུར་རོ། །
en: and recite the mantra one hundred and eight times. If one subsequently reads aloud a genuine Dharma text, one will become supremely intelligent within one month.

source: གི་ཝང་ལ་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ་དཔྲལ་བར་ཐིག་ལེ་བྱས་ན་སྐྱེ་བོ་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ། །
en: If one incants bovine bezoar one hundred and eight times and applies it as a bindi, one will be loved by all the people.

source: གཙུག་པུད་ལ་ལན་བདུན་བཟླས་པ་བྱས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནོད་པ་མེད་པར་འགྱུར་རོ། །
en: If one incants [one’s] topknot seven times, one will become invulnerable to assault by any being. {29.18}

source: མེ་ཏོག་གི་རི་མ་ལས་སྦྱིན་སྲེག་འབུམ་བྱས་ན་ནད་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་རོ། །
en: “If one offers ten thousand oblations of kiri garlands, one will become free from all disease.

source: ཉིན་རེ་ཞིང་བཟླས་པ་བདུན་བདུན་བྱས་ན་ངེས་པར་མྱོང་བར་འགྱུར་བའི་ལས་རྣམས་ཟད་པར་འགྱུར་རོ། །
en: If one recites the mantra seven times every day, one will purify the karma that would otherwise be inevitably experienced.

source: བཟླས་པ་བརྒྱ་རྩ་བརྒྱད་བྱས་ན་འཆི་བའི་དུས་ཀྱི་ཚེ་འཕགས་པ་འཇམ་དཔལ་གྱི་ཞལ་ཐམས་ཅད་མཐོང་བར་འགྱུར་རོ། །
en: If one recites the mantra one hundred and eight times at the time of death, one will behold the complete [form of] Noble Mañjuśrī face to face.

source: ལེའུ་བདུན་པའི་རས་རིས་ཀྱི་ཆོ་གའོ།། །།
en: This concludes the seventh [set of] rites [that employ] the painting.” {29.19}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས་འཇམ་དཔལ་གྱི་རས་རིས་ཀྱི་ཆོ་གའི་ལེའུ་རབ་འབྱམ་ལས། ཉི་ཤུ་རྩ་གསུམ་པ་རྫོགས་སོ།། །།
en: This concludes the detailed chapter with the seventh [set of] rites in the section on the ritual procedures that employ the painting of Noble Mañjuśrī, twenty-ninth in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings.

source: འཇམ་དཔལ་ཁྱོད་ཀྱི་སྔགས་དང་རྒྱུད་དང་རིག་པའི་རྒྱལ་པོ་དང་འཁོར་ལོས་སྒྱུར་བ་ལ་སོགས་པ་དང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཙུག་ཏོར་ལ་སོགས་པ་དང་སྔགས་ཐམས་ཅད་ཀྱི་གྲུབ་པའི་གནས་ཡོད་དེ
en: “There is, Mañjuśrī, in your mantra treatise, a list of places for accomplishing any vidyārāja mantra, starting with the mantra of Cakravartin —the foremost among all tathāgata- uṣṇīṣa s.

source: དེ་ཡང་མདོར་ན་བྱང་ཕྱོགས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིག་པའི་རྒྱལ་པོ་འགྲུབ་པར་འགྱུར་ཏེ།
en: In brief, everywhere in the northern regions, the mantras of tathāgata- vidyārāja s will become accomplished. {30.2}

source: རྒྱ་དང་རྒྱ་ནི་ཆེ་ཉིད་ལ། །འཇམ་པའི་དབྱངས་ནི་རབ་འགྲུབ་འགྱུར། །
en: “In Tibet and in China, Mañjughoṣa will be accomplished.

source: གང་ཡང་དེ་ཡི་སྔགས་རྣམས་ནི། །དེར་ནི་རབ་ཏུ་འགྲུབ་པར་འགྱུར། །
en: The mantras that are his Will be successful there. {30.3}

source: གཙུག་ཏོར་རྒྱལ་པོ་ཐམས་ཅད་དང་། །དེ་དག་ཏུ་ནི་གྲུབ་པར་སྣང་། །
en: “[The mantras] of uṣṇīṣa kings Will be successful there in every respect.

source: ཀཱ་བི་ཤེ་དང་བག་ཁ་ལ། །ཨོ་ཊི་ཡ་ནི་འཁོར་ཡུག་ཡུལ། །
en: In Kāviśa, Vakhala, Everywhere in Uḍḍiyāṇa, {30.4}

source: ཁ་ཆེ་དང་ནི་སིན་དྷུའི་ཡུལ། །ཁ་བ་ཅན་གྱི་མཚམས་ཀུན་དང་། །བྱང་ཕྱོགས་སུ་ནི་གནས་བརྟེན་ལ། །དགེ་བའི་སྔགས་ནི་འགྲུབ་པར་འགྱུར། །
en: “In Kaśmīra, Sindhudeśa, At the foot of the Himalayas— In these northern countries, The mantras that are virtuous are effective. {30.5}

source: གང་ཡང་སངས་རྒྱས་སྔོན་གསུངས་དང་། །ད་ལྟར་ཡང་ནི་གསུངས་པ་དང་། །མ་འོངས་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་། །ཞི་བའི་རྒྱུར་ནི་གསུངས་པ་སྟེ། །
en: “The mantras that are said to effect pacifying, Whether those chanted by the buddhas in the past, Those in use today, Or those that will be uttered by the buddhas in the future, {30.6}

source: ཁ་བ་ཅན་རིའི་ནང་བྱུང་བ། །དེར་ནི་ཐམས་ཅད་འགྲུབ་པར་འགྱུར། །
en: “All of them are effective In the foothills of the Himalayas;

source: སྐྱེ་བོ་སྐལ་ལྡན་བཟང་པོ་ནི། །ཞི་བའི་ལས་ནི་རྩོམ་པར་བྱེད། །
en: In that auspicious and virtuous region One should undertake pacifying activities. {30.7}

source: དེ་བཞིན་སྔགས་ནི་ཡུལ་དབུས་སུ། །པདྨའི་རིགས་ནི་འགྲུབ་པར་འགྱུར། །
en: “The mantras originating in the Lotus family Are accomplished in Madhyadeśa.

source: མཛོད་དང་ནོར་བུའི་རིགས་དག་ཀྱང་། །དེར་ནི་འགྲུབ་པར་རབ་ཏུ་སྣང་། །
en: Commonly observed there are also the accomplishments Of the Elephant and the Jewel families. {30.8}

source: གནོད་སྦྱིན་ལྔས་རྩེན་དག་དང་ནི། །འཕྲོག་མ་གནོད་སྦྱིན་སྐྱེ་གནས་དང་། །གང་དག་དྲི་ཟའི་སྔགས་རྣམས་ནི། །དེ་དག་ཏུ་ནི་གྲུབ་པར་གསུངས། །
en: “The mantras of beings of yakṣa origin, Such as the yakṣa Pañcika, and [the yakṣiṇī] Hārītī, And also the mantras of gandharva beings, All bring their respective accomplishments there. {30.9}

source: དེ་ནས་རྟག་ཏུ་ཀུ་ཤའི་གྲོང་། །མ་ག་དྷཱ་ནི་ཁོར་ཡུག་དང་། །ངོགས་དགའ་ཆུ་བོ་སྣར་མ་དང་། །བང་གའི་ཡུལ་ནི་ཐམས་ཅད་དུ། །
en: “Indeed, in the city of Vārāṇasī; Everywhere in Magadha; In Aṅga in the east, And everywhere in Kāmarūpa; {30.10} “On the pleasant banks of the Brahmaputra, And everywhere in Vaṅga,

source: དེ་བཞིན་ནོར་བུའི་རིགས་གསུངས་པའི། །ཛམ་བྷ་ལ་ནི་འགྲུབ་པར་འགྱུར། །
en: One will accomplish [the mantras of] Jambhala, Who, likewise, is said to be of the Jewel family. {30.11}

source: རྒྱ་མཚོ་དང་ན་གླིང་ངོགས་དང་། །ཆུ་ཡི་གཟི་ནི་ཐམས་ཅད་དང་། །དགའ་བའི་གྲོང་ཁྱེར་སིང་ཧ་ལར། །སྔགས་ཀྱི་ལྷ་ནི་འགྲུབ་པར་འགྱུར། །
en: “On the ocean shore or the islands, Everywhere near a [large] body of water, And in the pleasant city of Laṅkā, The [following] mantra deities can be accomplished: {30.12}

source: སྒྲོལ་མ་ཁྲོ་གཉེར་ཅན་དག་དང་། །དཔལ་ཆེན་མ་དང་གྲགས་ཆེན་མ། །གདུགས་དཀར་རྣམས་ཀྱི་སྔགས་རྣམས་དང་། །ཟླ་བའི་གྲོང་ཁྱེར་རྒྱ་མཚོ་དང་། །
en: “Bhṛkuṭī, Tārā, Mahāśriyā, Yaśasvinī, All the mantras [of the goddess] called Sitā, And the four Kumārīs [who live] in the great ocean. {30.13}

source: ཤར་གྱི་ཡུལ་ནི་ཁོ་ར་ཡུག །དེར་གནས་པ་ལ་འགྲུབ་པར་འགྱུར། །འབིགས་བྱེད་རི་ནང་གནས་པ་དང་། །ཡུལ་ནི་མཆོག་དབང་ཁོར་ཡུག་ཏུ། །
en: “They can be accomplished in these places And everywhere in the east, In the foothills of the Vindhyas, And everywhere in the Himalayas. {30.14}

source: སྨིན་དྲུག་བུ་བཞིན་འཇམ་དཔལ་ནི། །ཁོར་ཡུག་ཏུ་གྲུབ་པ་ཡིན། །རི་རྩེ་ཚང་ཚིང་ནང་དང་ནི། །རི་སུལ་དང་ནི་ནགས་བཅས་ལ། །
en: “[The mantras of] Kārttikeya and Mañjuśrī Can be accomplished anywhere in places Such as lovers’ hideouts, caves, Mountains, and wild forests. {30.15}

source: ལོག་འདྲེན་བགེགས་ནི་བྱེད་པ་ཡི། །བཟླས་པ་དག་ནི་འགྲུབ་པར་འགྱུར། །
en: “One can accomplish there [the mantras of] vināyakas Who create obstacles for mantra reciters—

source: གླང་པོའི་ཆ་བྱད་ཡང་དག་ལྡན། །མཆེ་བ་གཙིགས་པ་གཟི་བརྗིད་ཆེ། །
en: Powerful, single-tusked, And furnished with a trunk — {30.16}

source: དེ་བཞིན་རྟ་གཟུགས་དུ་མ་དང་། །དུ་མའི་རྣམ་པར་གྲགས་པ་ཡིན། །
en: “And also [the mantras of] those with the form of a horse And many other forms.

source: ལྷ་ནི་དབང་དང་ལྡན་པའི་བུ། །རྣམ་པ་སྣ་ཚོགས་བགེགས་བྱེད་པ། །
en: They are the divine sons of Īśāna Who create various obstacles. {30.17}

source: དེ་བསྟན་སྔགས་དང་ལྡན་པ་ཡི། །གྲུབ་པའི་ཞིང་དུ་རབ་ཏུ་སྣང་། །མ་མོ་མི་བཟད་རྣམ་སྣ་ཚོགས། །གཟའ་ཉིད་ཤིན་ཏུ་མི་བཟད་དང་། །
en: “The places thus described are also noted As the places of success for the mantras Of the mātṛs in their various shapes And the terrifying grahas. {30.18}

source: ཡི་དགས་སྐྱེ་གནས་བསྟན་པ་ཡིན། །མི་ཡི་ཟས་བྱེད་བདེན་བྲལ་དང་། །ཡི་དགས་རྒྱལ་པོར་བསྟན་པ་དང་། །དེ་དག་ཞིང་དུ་གྲུབ་པར་གསུངས། །དེ་ལ་སོགས་པའི་འབྱུང་པོ་ཀུན། །
en: “[The beings] designated as pretas by birth, Who feed on humans, [are associated with] the southwestern sector; [The mantras of] the preta king are recommended for that quarter, As it is the place where the corresponding accomplishments will arise. {30.19}

source: གྲུབ་པའི་ཞིང་དུ་གསུངས་པ་ཡིན། །
en: “It can also be recommended as the place of success [In controlling] all the spirits.

source: རྡོ་རྗེ་ཁྲོ་བོ་བརྩོན་འགྲུས་ཆེ། །དེ་དག་ཕྱོགས་སུ་གྲུབ་པ་ཡིན། །
en: [The mantras of] the valiant Vajrakrauñca Will be successful in his quarter. {30.20}

source: ལྷ་མིན་སྔགས་ཀྱི་གཙོ་བོ་དང་། །གང་གཞན་དེ་བཞིན་འཇིག་རྟེན་པའི། །སྔགས་རྒྱུད་ལྷོ་ཕྱོགས་དག་ཏུ་ནི། །བརྟེན་པ་དག་ལ་འགྲུབ་པར་འགྱུར། །
en: “The main asura mantras And other worldly mantras Will be effective there. The mantras belonging to the southern quarter {30.21}

source: རྟག་ཏུ་ཡི་དགས་རྒྱལ་པོ་དང་། །གཤིན་རྗེས་ཀྱང་ནི་བསྟན་པ་དང་། །ཞི་བ་ཁྱབ་འཇུག་གིས་བསྟན་པའི། །སྔགས་གཞན་དག་ཀྱང་འགྲུབ་པར་འགྱུར། །
en: “Are those of the king of the pretas Known as Yama—they are recommended [for that quarter]. The authentic Śaiva or Vaiṣṇava mantras Will also be effective [there]. {30.22}

source: གདུག་ཅིང་གདུག་པའི་ལས་དག་ནི། །ལྷ་ཡི་གནས་སུ་བསྟན་པ་ཡིན། །སྔགས་རྣམས་གདུག་པའི་ལས་རྣམས་ནི། །ལག་ན་རྡོ་རྗེས་བསྟན་པ་དག །
en: “When using cruel mantras in peaceful rites, These places are not suitable. For those who perform cruel rites, The mantras of Vajrapāṇi are recommended. {30.23}

source: ལྷོ་ཡི་ཕྱོགས་ལ་བསྟེན་ན་ནི། །སྡིག་པའི་ལས་ནི་འགྲུབ་པར་འགྱུར། །
en: “The mantras of those who perform evil rites Are effective in the south.

source: དེ་དག་གི་ནི་ཕྱོགས་དག་ཏུ། །མྱུར་དུ་ཡང་དག་འགྲུབ་པར་སྣང་། །
en: In that quarter will also be observed the arising Of the [corresponding] nonvirtuous results. {30.24}

source: ཉི་མས་བཤད་པའི་སྔགས་རྣམས་ནི། །ཉི་མའི་སྔགས་ཞེས་རབ་ཏུ་བསྒྲགས། །ནུབ་ཕྱོགས་ན་ནི་གང་ཡོད་པ། །སྔགས་དང་རྒྱུད་ནི་རབ་ཏུ་འགྲུབ། །
en: “The mantras taught to be of Āditya, Those known to be of Soma, And the mantras of Indra Are effective in the western quarter, the auspicious. {30.25}

source: གནོད་སྦྱིན་དབང་པོ་རྫུ་འཕྲུལ་ཆེའི། །དེར་ནི་རང་སྔགས་འགྲུབ་པར་འགྱུར། །
en: “The powerful lord of yakṣa s himself Will be accomplished there.

source: བྱིས་པ་རྣམས་ནི་རྨོངས་པ་ཡི། །འབྱུང་པོ་ཀུན་ལ་ནོར་སྦྱིན་ཞིང་། །ཆོ་ག་མཐོང་བའི་རྒྱུ་ཡིས་ནི། །སྐྱེ་བོ་རྣམས་ལ་ནོར་སྦྱིན་བྱེད། །
en: He grants wealth to all beings. To the naive and foolish {30.26} “He grants common sense. [These gifts are] his ritual specialty.

source: ལོངས་སྤྱོད་ལྡན་ཞིང་མཛོད་འཕེལ་བ། །ནུབ་ཀྱི་ཕྱོགས་སུ་འགྲུབ་པར་འགྱུར། །
en: This blissful fulfiller of aims Can be accomplished in the west.

source: ནོར་སྦྱིན་ཞེས་བྱའི་མིང་གིས་ནི། །ས་ཡི་སྟེང་དུ་རྣམ་པར་གྲགས། །
en: He is known here on earth As Dhanada, the ‘wealth giver.’ {30.27}

source: གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་རང་། །བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་ཆེ། །
en: “Vajrapāṇi, himself a yakṣa, Is a bodhisattva of great magical power.

source: སྔགས་པ་མཆོག་ནི་དམ་པ་སྟེ། །རང་ཉིད་ས་བཅུའི་བདག་པོ་ཡིན། །
en: Chief among the mantra deities, He is a master of the ten bodhisattva levels. {30.28}

source: རྡོ་རྗེ་པདྨའི་རིགས་དག་གི། །དེ་དག་སྔགས་ནི་གྲུབ་པ་ཡིན། །
en: “All the mantras—those that originate In the Vajra and Lotus families

source: དེ་བཞིན་རིགས་བརྒྱད་སྔགས་དག་ནི། །ཕྱོགས་བརྒྱད་དག་ཏུ་གནས་པ་ཡིན། །
en: And those of all the eight families— Belong to [their respective] eight quarters. {30.29}

source: རྒྱལ་བའི་རིགས་ཀྱི་སྔགས་དག་ནི། །བྱང་གི་ཕྱོགས་སུ་འགྲུབ་པ་ཡིན། །
en: “The mantras that originate from the Victorious One Can be accomplished in the northern quarter.

source: པདྨའི་རིགས་ལས་བྱུང་བའི་སྔགས། །དེ་བཞིན་ཤར་གྱི་ཕྱོགས་སུ་འགྲུབ། །
en: Those that originate from the Lotus family Can be accomplished in the eastern quarter. {30.30}

source: ལྷོ་ཡི་ཕྱོགས་སུ་གནས་པ་ལ། །རྡོ་རྗེའི་རིགས་ནི་འགྲུབ་པར་འགྱུར། །
en: “The mantras that belong to the Vajra family Can be accomplished in the southern quarter.

source: ནུབ་ཕྱོགས་སུ་ནི་མཛོད་འགྲུབ་གསུངས། །ཕྱོགས་མཚམས་དག་ཏུ་རིན་ཆེན་རིགས། །
en: The Elephant family is said to be in the west, And the Jewel family is at the intermediate point(s) of compass.

source: དེ་བཞིན་ནུབ་བྱང་མཚམས་སུ་ནི། །དེ་དག་འགྲུབ་པར་རབ་ཏུ་བརྟགས། །
en: The junction between the western and the northern quarters Is where the success of their [mantras] is said to belong. {30.31}

source: ལྷོ་ནུབ་ཀྱི་ནི་མཚམས་དག་ཏུ། །དེ་བཞིན་གནོད་སྦྱིན་རིགས་ཀྱང་འགྲུབ། །
en: “At the junction between the western and southern quarters, [The mantras of] the yakṣa family [can be accomplished],

source: ཤར་ལྷོ་དག་གི་ཆ་དག་ཏུ། །ཉན་ཐོས་རྣམས་ནི་གཟི་བརྗིད་ཆེ། །
en: And in the intermediate quarter between south and east, [The mantras of] the powerful śrāvakas. {30.32}

source: དེ་དག་རིགས་སུ་སྣང་བ་ནི། །དེར་གནས་པ་ལ་འགྲུབ་པར་འགྱུར། །
en: “[The mantras] indicated by the family name Will be effective in the places [as mentioned].

source: བྱང་ཤར་དག་གི་ཆ་དག་ཏུ། །རང་རྒྱལ་རྣམས་སུ་ཡང་དག་འབྱུང་། །
en: [The mantras] of the pratyeka­buddhas Originate in the northeastern quarter. {30.33}

source: རིགས་ནི་འཇིག་རྟེན་ཀུན་གྱིས་མཆོད། །དེ་དག་དེར་ནི་འགྲུབ་པ་ཡིན། །
en: “[Wherever] in the world [a particular] family is highly esteemed, In those places [its mantras] will be effective.

source: འོག་གི་ཕྱོགས་ཀྱི་ཆ་དག་ཏུ། །འཇིག་རྟེན་པ་ཡི་སྔགས་རྣམས་འགྲུབ། །
en: All the worldly mantras will be effective In the world division below. {30.34}

source: ས་འོག་འཇུག་པར་གྱུར་པའི་སྔགས། །རིགས་བརྒྱད་ཀུན་ལ་འགྲུབ་པར་འགྱུར། །
en: “Thus, for entering the subterranean paradises, The mantras of [all] the eight families will be effective.

source: དེ་བཞིན་འཇིག་རྟེན་འདས་པའི་སྔགས། །གཙུག་ཏོར་ལ་སོགས་རབ་བསྒྲགས་པ། །
en: There are also supramundane mantras— They are the uṣṇīṣa mantras, and so forth. {30.35}

source: སྟེང་དུ་འགྲོ་བའི་གྲུབ་པར་ནི། །རྒྱལ་བ་འཁོར་ལོ་སྒྱུར་བས་གསུངས། །
en: “Originating from the wheel-turning victors, They can be accomplished in the world division above.

source: ཐད་ཀར་ཀུན་ནས་ཁོར་ཡུག་ཏུ། །རྡོ་རྗེ་ཅན་གྱི་འགྲུབ་པ་ཡིན། །
en: The mantras of the vajra holder Are effective everywhere, in all world divisions. {30.36}

source: དེ་བཞིན་གཞན་ཡང་སྔགས་རྒྱལ་ཀུན། །པདྨའི་རིགས་ལས་བྱུང་བ་ནི། །ཐམས་ཅད་དུ་ནི་ཐམས་ཅད་འགྲུབ། །
en: “Similarly, the other mantra-kings, Such as all those that originate in the Lotus family, Can all be accomplished everywhere.

source: སྔགས་རྣམས་ཀུན་ཀྱང་ལོངས་སྤྱོད་སྟེར། །
en: The same is true for all the mantras that bring enjoyments and profit. {30.37}

source: རྡོ་རྗེ་པདྨའི་རིགས་དག་ཀྱང་། །དུས་རྣམས་ཀུན་ཏུ་འགྲུབ་པར་འགྱུར། །
en: “[The mantras] of the Vajra and Lotus families Are effective throughout the entire period [indicated for them].

source: འདི་དག་ཞིང་དུ་བསྟན་པ་སྟེ། །དེ་ཡི་དུས་ནི་ཡོངས་སུ་བསྟན། །
en: The recommended places have already been specified; Now the time is being told: {30.38}

source: རྒྱལ་བའི་རིགས་ཀྱི་སྔགས་གྲུབ་པ། །སངས་རྒྱས་རྣམས་ལ་སྔོན་བྱུང་བའོ། །
en: “The mantra accomplishments related to the victorious ones Arise at [the time of] the arising of any buddha.

source: པདྨ་རྡོ་རྗེའི་རིགས་དག་ནི། །སངས་རྒྱས་རྣམས་ཀྱི་བར་མའི་དུས། །
en: During the middle time of the buddhas, The accomplishments related to the Lotus and Vajra families arise. {30.39}

source: གཞན་གྱི་དུས་སུ་སྔགས་དག་ནི། །དེ་ལས་གཞན་པའི་རིགས་འགྲུབ་ཡིན། །
en: “The mantras belonging to other families Are accomplished at other times.

source: དེ་དག་གྲུབ་པའི་དུས་སུ་གསུངས། །
en: Their success depends on the right time;

source: དུས་གཞན་རབ་ཏུ་བསྟན་མ་ཡིན། །
en: It is said not to arise at other times. {30.40}

source: དཀའ་ཐུབ་ཀྱིས་ནི་གྲུབ་པ་མཆོག །སྐྱེ་བ་གསུམ་གྱིས་ཐོབ་པར་འགྱུར། །
en: “The highest accomplishment comes from ardor; It can be attained within three births.

source: རྟག་ཏུ་སྔགས་རྣམས་ཟློས་པ་དང་། །དེར་དང་ཡིད་ནི་དེར་སེམས་དང་། །
en: However, those who recite the mantra continually, Are mentally devoted to it, {30.41}

source: རྒྱལ་སྲས་རྣམས་ལ་རབ་དང་བ། །སྐྱེ་བ་འདི་ལའང་འགྲུབ་པར་འགྱུར། །
en: “And have faith in the bodhisattvas Can attain accomplishment even in this life.

source: དཀོན་མཆོག་གསུམ་ལ་གུས་པ་དང་། །བྱང་ཆུབ་སེམས་ཀྱིས་བརྒྱན་པ་དང་། །
en: If they have faith in the Three Jewels, Are adorned with bodhicitta, {30.42}

source: ཤེས་རབ་ཆེ་ཞིང་སྡོམ་ལ་གནས། །སྔགས་དང་རྒྱུད་ལ་འཇིགས་པ་མེད། །
en: “Observe the prescribed conduct, have great insight, And have confidence in the tantras and mantras,

source: བྱང་ཆུབ་སྡོམ་ལ་གནས་པ་དག །འབད་པ་མེད་པར་སྔགས་རྣམས་འགྲུབ། །
en: Their mantras will be accomplished without effort, As they thus maintain the conduct of awakening. {30.43}

source: སེམས་ཅན་རྣམས་ཀྱིས་ལས་གྲུབ་དང་། །བདག་ཀྱང་གྲུབ་པར་ཉེར་བསྟན་པ། །
en: “Ordinary beings, [too], can accomplish their rites And fulfill their specified individual aims.

source: རྟག་ཏུ་སྔགས་ཉིད་གྲུབ་པ་ཡིན། །རྨོངས་པའི་སེམས་ཅན་འགྲུབ་པ་མེད། །
en: The mantras can always be accomplished, But not by beings who are deluded. {30.44}

source: དེ་ཉིད་ཕྱིར་ན་རྒྱལ་དབང་གིས། །ཆོ་གའི་རྒྱལ་པོ་གསུངས་པ་ནི། །
en: “For this reason, the victorious ones Have taught this king of manuals,

source: སངས་རྒྱས་གཙོ་བོ་བདུན་པ་ཡིས། །སྔགས་རྣམས་རྒྱ་ཆེའི་ལས་དག་བསྟན། །
en: And so, [too], the seventh chief buddha Teaches in detail its rituals and mantras.” {30.45}

source: སངས་རྒྱས་སྲས་ཀྱི་ཐུ་བོ་ནི། །འཇམ་པའི་དབྱངས་ནི་གཟི་ཆེན་ལ། །ཐུབ་པའི་ཟླ་བ་རྫུ་འཕྲུལ་ཆེ། །དེས་ནི་གསུང་མཆོག་རབ་ཏུ་བསྟན། །
en: The foremost among sages, This majestic moon among buddhas, Further said to the seniormost son of the buddhas, Mañjughoṣa of great splendor: {30.46}

source: སྔགས་རྣམས་ཀྱི་ནི་མཐར་ཐུག་མཐུ། །གཞོན་ནུ་རབ་ཏུ་ཉོན་ཅིག་དང་། །
en: “Listen, O divine youth, about the power of mantras To manifest the highest destiny.

source: གང་ཚེ་སངས་རྒྱས་རྟག་ཏུ་ནི། །འཇིག་རྟེན་འདྲེན་པ་བཞུགས་གྱུར་པ། །
en: At the time when the buddhas, the guides of the world, Are physically present, {30.47}

source: དེ་ཚེ་དེ་བཞིན་གྲུབ་པ་ནི། །གཙུག་ཏོར་ལ་སོགས་རབ་གྲགས་པ། །
en: “At that time the accomplishment Of uṣṇīṣa and other such mantras is noteworthy.

source: དེ་བཞིན་འཁོར་ལོས་སྒྱུར་བ་དང་། །གཟི་བརྗིད་ཕུང་པོར་རབ་བསྟན་དང་། །
en: At that time King Cakravartin And Tejorāśi become celebrated. {30.48}

source: རྒྱལ་བ་གཙུག་ཏོར་གདུགས་དཀར་པོ། །རྒྱལ་བས་མང་པོར་གསུངས་པ་ནི། །དེ་ལ་སོགས་པའི་གཙུག་ཏོར་ནི། །དེ་ཡི་ཚེ་ནི་འགྲུབ་པར་འགྱུར། །
en: “[Also,] Sitātapatra and Jayoṣṇīṣa Are extolled by the victorious ones. These and other uṣṇīṣa [kings] Will be accomplished at that time. {30.49}

source: གང་ཚེ་འཁོར་ལོས་སྒྱུར་བ་ནི། །འཛམ་བུའི་གླིང་དུ་འབྱུང་འགྱུར་ཞིང་། །ཆོས་ཀྱི་རྒྱལ་པོ་རྫོགས་སངས་རྒྱས། །རྐང་གཉིས་དམ་པ་བཞུགས་པ་ན། །
en: “At the time when the wheel turner Is reborn in Jambūdvīpa And remains there as the supreme among two-legged beings— The Dharma king, the fully realized Buddha—

source: སྔགས་རྣམས་མ་ལུས་བཤད་པ་དག །དེ་ཡི་ཚེ་ན་འགྲུབ་པར་འགྱུར། །
en: At that time all the mantra utterances Will lead to accomplishment.” {30.50}

source: འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། ཞིང་དང་དུས་ཀྱི་ཆོ་ག་ངེས་པའི་ལེའུ་རབ་འབྱམ་ལས། ཉི་ཤུ་རྩ་བཞི་པ་རྫོགས་སོ།། །།
en: This concludes the detailed chapter on the ritual restrictions concerning the place and the time [of accomplishing the mantras], thirtieth in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་རས་རིས་ནི་སྔར་བསྟན་ཏེསེམས་ཅན་ལ་ཡོད་པའི་སྤྱོད་པ་དགེ་བ་དང་མི་དགེ་བའི་མཚན་མ་རྣམས་ནི་བཤད་པར་བྱ་ཡི་ཉོན་ཅིག །
en: “Listen Mañjuśrī, divine youth, as I teach about the ways of spirits who possess other beings, and the accompanying auspicious and inauspicious signs.” {31.1}

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་བཏུད་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Mañjuśrī, the divine youth, rose from his seat, prostrated at the feet of the Blessed One, folded his hands, and said to the Blessed One: “Good it is, O Blessed One!

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ནི་གཞན་གྱི་ལུས་ལ་འཇུག་པའི་སེམས་ཅན་རྣམས་ཏེ། འཕགས་པ་དང་ལྷའི་སྐྱེ་གནས་དང་གྲུབ་པ་དང་དྲི་ཟ་དང་གནོད་སྦྱིན་དང་སྲིན་པོ་དང་ཤ་ཟ་དང་ལྟོ་འཕྱེ་ཆེན་པོ་ལ་སོགས་པ་ལས་སྣ་ཚོགས་ཀྱིས་བྱས་པའི་ལུས་རྣམ་པ་སྣ་ཚོགས་ལ་བརྟེན་ཅིང་གནས་པ། ཆ་བྱད་རྣམ་པ་སྣ་ཚོགས་དང་རྟགས་སྣ་ཚོགས་དང་མི་དང་མི་མ་ཡིན་པ་དང་འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་བཅོམ་ལྡན་འདས་བསྟན་པའི་དུས་ལགས། བདེ་བར་གཤེགས་པ་བསྟན་པའི་དུས་ནི་ལགས་ཏེ། དེའི་དུས་ལ་བབ་པར་མཁྱེན་ན་ལེགས་པར་བཤད་དུ་གསོལ།
en: Please teach about the thoughts and actions ( cittacaritāni ) of beings who enter other beings’ bodies—the noble and divine siddha s, gandharvas, yakṣa s, rākṣasas, piśācas, mahoragas, and so forth, and the human and nonhuman beings whose bodies are generated by different types of karma and who have taken different types of birth and have different forms and characteristics. Now it has come to pass, O Blessed One! Now it has come to pass, O Sugata, if you think that the time is right!” {31.2}

source: དེ་སྐད་ཅེས་རྒྱལ་བའི་མཆོག་འཇིག་རྟེན་གྱི་འདྲེན་པ་གཽ་ཏ་མ་བདུན་པ་ལ་གསོལ་བ་བཏབ་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཅང་མི་སྨྲ་བར་གྱུར་ཏེ། རང་གི་སྟན་ལ་འདུག་པར་གྱུར་ཏོ། །
en: Having thus spoken, Mañjuśrī, the divine youth, became silent. Having made his request, he now remained in his seat, waiting for Gautama, the supreme Victor, the guide of the world, the seventh of the victorious ones.
